var botui = new BotUI('help-bot');
const messagesJSON = {
  "корупція": "<b>Корупція</b> - негативне соціальне явище, що полягає в умисному використанні особою займаної посади в корисливих цілях для особистого збагачення чи збагачення інших осіб усупереч інтересам держави та суспільства.",
  "академічна доброчесність": "<b>Академічна доброчесність </b>- це сукупність етичних принципів та визначених законом " +
        "правил, якими мають керуватися учасники освітнього процесу під час навчання,"+
        " викладання та провадження наукової (творчої) діяльності з метою забезпечення " +
        "довіри до результатів навчання та/або наукових (творчих) досягнень",
  "академічний плагіат": "<b>Академічний плагіат</b> - оприлюднення (частково або повністю) наукових (творчих) результатів, отриманих іншими особами, як результатів власного дослідження (творчості)," +
        "та/або відтворення опублікованих текстів (оприлюднених творів мистецтва) інших авторів без зазначення авторства",
  "помилки цитування": "<b>Помилка цитування</b> - мале порушення академічної доброчесності. Туди входять відсутність лапок при використанні текстових фрагментів, що запозичені з інших джерел" +
        " посилання на інше джерело, неправильне оформлення посилання.",
  "самоплагіат": "<b>Самоплагіат</b> - оприлюднення (частково або повністю) власних раніше опублікованих наукових результатів як нових наукових результатів",
  "фабрикація": "<b>Фабрикація</b> - вигадування даних чи фактів, що використовуються в освітньому процесі чи наукових дослідженнях." +
        " Наприклад  дані про експерименти, емпіричні дослідження, вимірювання, розрахунки, опитування, інші види досліджень та їх апробацію, які насправді не виконувалися",
  "фальсифікація": "<b>Фальсифікація</b> — «свідома зміна чи модифікація вже наявних даних, що стосуються освітнього процесу чи наукових досліджень»",
  "списування": "<b>Списування</b> — «виконання письмових робіт із залученням зовнішніх джерел інформації, крім дозволених для використання, зокрема під час оцінювання результатів навчання»",
  "хабарництво": "<b>Хабарництво</b> — «надання (отримання) учасником освітнього процесу чи пропозиція щодо надання (отримання) коштів, майна, послуг, пільг чи будь-яких інших благ " +
        "матеріального або нематеріального характеру з метою отримання неправомірної переваги в освітньому процесі»",
  "1" : "<b>Дотримання правил</b> та <b>дотримання доброчесності</b> є двома провідними підходами",
  "2КоефіцієнтПлагіату" : "<b>Ні, немає</b>;<br/> коефіцієнти мають рекомендоване граничне значення в Україні",
  "3" : "Заміна вокабуляру",
  "4" : "<b>Так</b>, дослідження Softwaretest2020 це довело",
  "5РозумнийРозвиток" : "Концепція «Стратегія «Європа 2020»<br/>Концепція «Стратегія «Європа 2030»<br/>Лейпцизька хартія;",
  "6" : "Європейська Комісія, Європейська Рада, Рада ЄС, Європейський Центральний Банк",
  "7" : `Перефразування не передбачає:<br/>
  <ul>
    <li>скорочення тексту оригіналу</li>
    <li>деталізація тексту оригіналу</li>
  </ul>`,
  "8" : "<b>Так</b>, академічний плагіат, самоплагіат, списування є порушенням академічної доброчесності",
  "9" : "довіра<br/>  повага <br/> чесність",
  "10": "Це знак авторського права, після якого зазначають особу, якій належать права",
  "11" : `Етичні принципи визначає Платформа ЄС ETINED: <br/>
  <ul>
    <li>Чесність;</li>
    <li>Порядність/надійність;</li>
    <li>Правдивість;</li>
    <li>Прозорість;</li>
    <li>Повага до інших;</li>
    <li>Довіра;</li>
    <li>Підзвітність;</li>
    <li>Справедливість;</li>
    <li>Рівність, загальна справедливість, соціальна справедливість;</li>
    <li>Демократичне та етичне врядування та управління системою освіти та навчальними закладами;</li>
    <li>Якісна освіта;</li>
    <li>Розвиток особистості та системи;</li>
    <li>Інституційна автономія/ незалежність;</li>
    <li>Міжнародне співробітництво.</li>
  </ul>`,
  "12.1" : `<b>Так</b>, використання інструментів Штучного Інтелекту є доброчесною практикою під час складання ідей і планування структури письмових робіт`,
  "12.2" : `<b>Так</b>, використання інструментів Штучного Інтелекту є доброчесною практикою під час генерування ідей для графіки, зображень і візуальних елементів`,
  "12.3" : `<b>Так</b>, використання інструментів Штучного Інтелекту є доброчесною практикою для отримання тлумачення якогось поняття`,
  "12.4" : `<b>Так</b>, використання інструментів Штучного Інтелекту є <u>недоброчесною практикою</u> під час виконання тестових завдань`,
  "13" : `
  <ul>
    <li>DeepL Write</li>
    <li>Grammarly</li>
    <li>Languagetool.org</li>
  </ul>
  `,
  "14" : "<b>Так</b>, але про це потрібно задекларувати на початку роботи",
  "15" : "<b>Так</b>, на початку роботи (для кваліфікаційних робіт) або в розділі «Методи»/ «Інструменти» (в науковій статті)",
};
function getMessageByKey(key) {
  if (key in messagesJSON) {
    return messagesJSON[key]; // Return the corresponding message
  } else {
    return "Упс, щось пішло не так("; // Return a message for keys that don't exist
  }
}
function scrollToBottom(divId) {
  var div = document.getElementsByClassName(divId);
  // Ensure the div exists
  if (div) {
    // Set the scroll position to the height of the div
    div.scrollTop = div.scrollHeight;
  } else {
    console.error("Div with ID " + divId + " not found.");
  }
}

//Beginning
botui.message.add({
  delay: 500,
  loading: true,
  content: 'Вітаю! Це чатбот по <i>Erasmus+</i>, що стосується питань академічної доброчесності'
}).then(function () {
  botui.message.add({
    delay: 500,
    loading: true,
    content: 'Про що хотіли б сьогодні поговорити?'
  });
  startConversation();
})

//Основне роздоріжжя
function startConversation() {
  botui.action.button({
      action: [
        {
          text: 'Порушення академічної доброчесності',
          value: 'illegal'
        },
        {
          text: 'Законодавча база',
          value: 'law'
        },
        {
          text: 'Академічна доброчесність це...',
          value: 'akadem'
        },
        {
          text: 'Академічно доброчесна поведінка',
          value: 'akademPositive'
        },
        {
          text: 'Доброчесна взаємодія зі Штучним Інтелектом',
          value: 'AIInteraction'
        },
      ]
    }).then(function (res) {
  
    if (res.value === "illegal") {
      illegalActiions();
    } else if (res.value === "law") {
      laws();
    } else if(res.value === "akadem"){
      akademInfo();
    } else if(res.value === "akademPositive"){
      akademPositive()
    } else if(res.value === "AIInteraction"){
      AIInteraction();
    }
  })
}
//Рестарт
function wasThatUseful() {
  botui.message.add({
    type: 'html',
    delay: 800,
    loading: true,
    content: "Про що іще хотіли б сьогодні поговорити?"
  })
  startConversation();
}
//Закони
function lawsInfo(){
  botui.message.add({
    type: 'html',
    delay: 1000,
    loading: true,
    content: "Нормативно-правове забезпечення впровадження принципів академічної доброчесності в Україні складається із:"
  }).then(function () {
    return botui.message.add({
      type: 'html',
      delay: 1000,
      loading: true,
      content: "- Закону України «Про освіту»;"
    });
  }).then(function () {
    return botui.message.add({
      type: 'html',
      delay: 800,
      loading: true,
      content: "- спеціальних законів України «Про вищу освіту», «Про професійну освіту», «Про фахову передвищу освіту», «Про загальну середню освіту», «Про дошкільну освіту», «Про" +
      " позашкільну освіту» (деякі з цих законів ще розробляються або поки не містять відповідних норм);"
    });
  }).then(function () {
    return botui.message.add({
      type: 'html',
      delay: 800,
      loading: true,
      content: "- Закону України «Про наукову та науково-технічну діяльність»;"
    });
  }).then(function () {
    return botui.message.add({
      type: 'html',
      delay: 800,
      loading: true,
      content: "- нормативних актів Кабінету Міністрів України, центральних органів виконавчої влади," +
      " що мають у сфері свого підпорядкування заклади освіти та/або наукові установи;"
    });
  }).then(function () {
    return botui.message.add({
      type: 'html',
      delay: 800,
      loading: true,
      content: "- статутів та інших внутрішніх нормативних документів (кодекси честі, правила " +
        "внутрішнього розпорядку, процедури прийняття рішень з питань імовірних порушень " +
        "академічної доброчесності тощо) закладів освіти та наукових установ."
    });
  }).then(function() {
    wasThatUseful();
  })
}
//Академ доброчесність
function akademInfo() {
  botui.message.add({
    type: 'html',
    delay: 1000,
    loading: true,
    content: "<b>Академічна доброчесність</b> - це сукупність етичних принципів та визначених законом" +
    "правил, якими мають керуватися учасники освітнього процесу під час навчання,"+
    "викладання та провадження наукової (творчої) діяльності з метою забезпечення" +
    "довіри до результатів навчання та/або наукових (творчих) досягнень"
  }).then(function() {
    wasThatUseful();
  })
}
function akademPositive(){
  botui.message.add({
    type: 'html',
    delay: 1000,
    loading: true,
    content: "Про які деталі академічно доброчесної поведінки вам було б цікаво дізнатись?"
  })
  
  .then(function () {
    scrollToBottom("botui-messages-container");
    return botui.action.button({
      action: [
        {
          text: 'Чи існує в Україні нормативно-правова база, що визначає показник коефіцієнта подібності текстів під час перевірки на плагіат?',
          value: '2КоефіцієнтПлагіату'
        },
        {
          text: 'Що перебачає перефразування як одна з доброчесних практик в академічному письмі?',
          value: '3'
        },
        {
          text: 'Чи є системи перевірки текстів на плагіат, непридатні для перевірки академічних текстів?',
          value: '4'
        },
        {
          text: 'Що не передбачає перефразування як одна з доброчесних практик в академічному письмі?',
          value: '7'
        },
        {
          text: 'Чи доброчесно використовувати інструменти Штучного Інтелекту студентом під час підготовки розділів (письмових) завдань / наукових робіт?',
          value: '14'
        },
        {
          text: 'Чи потрібно в науковій праці або іншій письмовій роботі засвідчувати про використання засобів Штучного Інтелекту згідно з етичними принципами?',
          value: '15'
        }
      ]
    });
  })
  .then(function (res) {  
    return botui.message.add({
      type: 'html',
      delay: 1000,
      loading: true,
      content: getMessageByKey(res.value)
    });
  }).then(function() {
    wasThatUseful();
  })
}
function AIInteraction(){
  botui.message.add({
    type: 'html',
    delay: 1000,
    loading: true,
    content: "Що б ви хотіли дізнатись про взаємодію Штучного Інтелекту та доброчесності?"
  })  
  .then(function () {
    return botui.action.button({
      action: [
        {
          text: 'Чи є використання інструментів Штучного Інтелекту доброчесною практикою під час складання ідей і планування структури письмових робіт?',
          value: '12.1'
        },
        {
          text: 'Чи є використання інструментів Штучного Інтелекту доброчесною практикою під час генерування ідей для графіки, зображень і візуальних елементів?',
          value: '12.2'
        },
        {
          text: 'Чи є використання інструментів Штучного Інтелекту доброчесною практикою для отримання тлумачення якогось поняття?',
          value: '12.3'
        },
        {
          text: 'Чи є використання Штучного Інтелекту недоброчесною практикою під час виконання тестових завдань?',
          value: '12.4'
        },
        {
          text: 'Які онлайн ресурси Штучного Інтелекту є асистентами під час написання тексту роботи?',
          value: '13'
        },
        {
          text: 'Чи доброчесно використовувати інструменти Штучного Інтелекту студентом під час підготовки розділів (письмових) завдань / наукових робіт?',
          value: '14'
        },
        {
          text: 'Чи потрібно в науковій праці або іншій письмовій роботі засвідчувати про використання засобів Штучного Інтелекту згідно з етичними принципами?',
          value: '15'
        }
      ]
    });
  })  .then(function (res) {  
    scrollToBottom("botui-messages-container");
    return botui.message.add({
      type: 'html',
      delay: 1000,
      loading: true,
      content: getMessageByKey(res.value)
    });  }).then(function() {
    wasThatUseful();
  })
}

function laws(){
  botui.message.add({
    type: 'html',
    delay: 1000,
    loading: true,
    content: "Які законодавчі аспекти вас цікавлять?"
  })  .then(function () {
    return botui.action.button({
      action: [
        {
          text: 'Чи існує в Україні нормативно-правова база, що визначає показник коефіцієнта подібності текстів під час перевірки на плагіат?',
          value: '2КоефіцієнтПлагіату'
        },
        {
          text: 'У яких документах ЄС відображено концепцію розумного розвитку?',
          value: '5РозумнийРозвиток'
        },
        {
          text: 'У яких документах ЄС відображено концепцію розумного розвитку? ',
          value: '6'
        },
        {
          text: 'Які три принципи академічної доброчесності передбачено в Бухарестській декларації з етичних цінностей і принципів вищої освіти?',
          value: '9'
        },
        {
          text: 'Що означає знак © ?',
          value: '10'
        },
        {
          text: 'Які етичні принципи визначає Платформа ЄС ETINED ?',
          value: '11'
        }
      ]
    });
  }).then(function (res) {  
    return botui.message.add({
      type: 'html',
      delay: 1000,
      loading: true,
      content: getMessageByKey(res.value)
    });}).then(function() {
    wasThatUseful();
  })
}
//Порушення
function illegalActiions(){
  botui.message.add({
    type: 'html',
    delay: 1000,
    loading: true,
    content: "Про які сфери ви хотіли б дізнатись?"
  })
  
  .then(function () {
    return botui.action.button({
      action: [
        {
          text: 'Корупція',
          value: 'корупція'
        },
        {
          text: 'Академічний плагіат',
          value: 'академічний плагіат'
        },
        {
          text: 'Помилки цитування',
          value: 'помилки цитування'
        },
        {
          text: 'Самоплагіат',
          value: 'самоплагіат'
        },
        {
          text: 'Фабрикація',
          value: 'фабрикація'
        },
        {
          text: 'Фальсифікація',
          value: 'фальсифікація'
        },
        {
          text: 'Списування',
          value: 'списування'
        },
        {
          text: 'Хабарництво',
          value: 'хабарництво'
        }
      ]
    });
  })
  .then(function (res) {  
    return botui.message.add({
      type: 'html',
      delay: 1000,
      loading: true,
      content: getMessageByKey(res.value)
    });
  }).then(function() {
    wasThatUseful();
  })
}